[
  {
    "name": "آدم",
    "meaning": "من أديم الأرض (أي التراب)",
    "details": "أول إنسان خلقه الله من تراب، وأسكنه الجنة ثم أُهبط إلى الأرض، وهو أول الأنبياء."
  },
  {
    "name": "إدريس",
    "meaning": "كثير الدراسة أو التعلم",
    "details": "من أوائل الأنبياء بعد آدم، كان يعلّم الناس الكتابة والخياطة، ورفعَه الله مكانًا عليًا."
  },
  {
    "name": "نوح",
    "meaning": "من النواح أو البكاء (كثرة البكاء من خشية الله)",
    "details": "أول رسول أُرسل إلى قومه بعد أن عبدوا الأصنام، دعاهم 950 سنة ولم يؤمن معه إلا قليل، ونجاه الله بالطوفان."
  },
  {
    "name": "هود",
    "meaning": "من الهداية",
    "details": "أُرسل إلى قوم عاد ليدعوهم إلى عبادة الله، فكذبوه فأهلكهم الله بالريح العاتية."
  },
  {
    "name": "صالح",
    "meaning": "الطيب المستقيم",
    "details": "نبي ثمود، أرسله الله إليهم ومعه ناقة كآية، فكذبوه فعُذبوا بالصيحة."
  },
  {
    "name": "إبراهيم",
    "meaning": "الأب الرحيم أو كثير الرحمة",
    "details": "أبو الأنبياء، دعا قومه إلى عبادة الله، وبنى الكعبة مع ابنه إسماعيل، وابتُلي بذبح ابنه."
  },
  {
    "name": "لوط",
    "meaning": "الارتباط أو التعلق",
    "details": "نبي أُرسل إلى قوم فاحشين (قوم لوط)، دعاهم للتوبة لكنهم كذبوه، فأهلكهم الله."
  },
  {
    "name": "إسماعيل",
    "meaning": "يسمع الله (أي استجاب الله)",
    "details": "ابن إبراهيم، صبر على أمر الله حين أمر والده بذبحه، وكان من الصالحين وبُنيت الكعبة معه."
  },
  {
    "name": "إسحاق",
    "meaning": "الضحاك أو الذي يضحك",
    "details": "ابن إبراهيم من سارة، بُشّر به وهو شيخ كبير، وهو والد يعقوب عليه السلام."
  },
  {
    "name": "يعقوب",
    "meaning": "الذي يعقب أو يأتي بعد",
    "details": "ابن إسحاق، وأب يوسف عليه السلام، صبر على فقد ابنه، وكان من العابدين."
  },
  {
    "name": "يوسف",
    "meaning": "الله يزيد أو يمنح",
    "details": "ابن يعقوب، أُلقي في الجب من إخوته، ثم أصبح عزيز مصر بعد صبر طويل."
  },
  {
    "name": "شعيب",
    "meaning": "الذي يجتمع إليه الناس",
    "details": "أُرسل إلى مدين، دعاهم لترك الغش في الكيل والميزان، فكذبوه فأُهلكوا."
  },
  {
    "name": "أيوب",
    "meaning": "الراجع إلى الله أو الصابر",
    "details": "ابتلاه الله في جسده وماله وأهله فصبر، فضرب الأرض برجله فأنبع الله له ماءً شافاه."
  },
  {
    "name": "ذو الكفل",
    "meaning": "صاحب النصيب أو الحظ",
    "details": "نبي صالح وصبور، قيل إنه لم يغضب قط، وكان مثالًا في العدل والوفاء."
  },
  {
    "name": "يونس",
    "meaning": "الحمامة أو ذو النون",
    "details": "أرسله الله إلى نينوى، فغضب وترك قومه فابتلعه الحوت، فتاب إلى الله فنجاه."
  },
  {
    "name": "موسى",
    "meaning": "المنقذ من الماء",
    "details": "كلمه الله مباشرة، أُرسل إلى فرعون ومعه التوراة، وأظهر الله على يده معجزات عظيمة."
  },
  {
    "name": "هارون",
    "meaning": "الجبل القوي أو الثابت",
    "details": "أخو موسى وشريكه في الدعوة، كان فصيح اللسان وساعد موسى في دعوته لفرعون."
  },
  {
    "name": "إلياس",
    "meaning": "الرب إلهي",
    "details": "أُرسل إلى بني إسرائيل ليعبدوا الله وحده، ودعاهم لترك عبادة الأصنام."
  },
  {
    "name": "اليسع",
    "meaning": "الله خلاص أو منقذ",
    "details": "تلميذ إلياس عليه السلام، تابع دعوته بعده، وكان من الصالحين."
  },
  {
    "name": "داوود",
    "meaning": "المحبوب",
    "details": "ملك ونبي، أنزل الله عليه الزبور، وأعطاه صوتًا جميلًا وكان قاضيًا عادلًا."
  },
  {
    "name": "سليمان",
    "meaning": "السلام أو الرجل المسالم",
    "details": "ابن داوود، ملك صالح، سخّر الله له الجن والرياح والحيوانات."
  },
  {
    "name": "زكريا",
    "meaning": "ذكر الله",
    "details": "نبي صالح، دعا الله أن يرزقه ولدًا فاستجاب له ورُزق بيحيى رغم كبر سنه."
  },
  {
    "name": "يحيى",
    "meaning": "الحي أو من أحياه الله",
    "details": "ابن زكريا، نبي زاهد، دعا إلى التوبة والإيمان، وقتله الظالمون ظلمًا."
  },
  {
    "name": "عيسى",
    "meaning": "المخلِّص أو العبد الصالح",
    "details": "ولد من غير أب بمعجزة من الله، تكلم في المهد، وأُرسل لبني إسرائيل بالإنجيل."
  },
  {
    "name": "محمد",
    "meaning": "كثير الحمد",
    "details": "خاتم الأنبياء والمرسلين، أرسله الله رحمة للعالمين، أنزل عليه القرآن الكريم."
  },
  {
    "name": "إدريس الثاني",
    "meaning": "كثير العلم والمعرفة",
    "details": "نبي صالح، علّم الناس الكتابة والحكمة، ويقال إنه كان أول من خاط الثياب."
  },
  {
    "name": "شيث",
    "meaning": "هبة الله",
    "details": "ابن آدم عليه السلام، ووريث النبوة بعده، علّمه الله العلم والحكمة."
  },
  {
    "name": "خنوخ",
    "meaning": "المكرس أو المخلص لله",
    "details": "قيل إنه هو إدريس عليه السلام، من أوائل الأنبياء الذين علّموا الناس العلوم."
  },
  {
    "name": "جرجيس",
    "meaning": "الزارع أو المزارع",
    "details": "من أنبياء الله دعا قومه إلى التوحيد فقتلوه ثم أحياه الله آيةً لهم."
  },
  {
    "name": "أرميا",
    "meaning": "يرفعه الله",
    "details": "نبي من بني إسرائيل، دعا قومه للتوبة قبل أن يُسبوا إلى بابل."
  },
  {
    "name": "حزقيال",
    "meaning": "قوة الله",
    "details": "نبي من أنبياء بني إسرائيل، بُعث بعد نبي الله داوود عليه السلام."
  },
  {
    "name": "شموئيل",
    "meaning": "اسم الله",
    "details": "نبي من أنبياء بني إسرائيل، دعاهم لعبادة الله وأقام العدل فيهم."
  },
  {
    "name": "عزير",
    "meaning": "القوي أو العزيز",
    "details": "نبي من بني إسرائيل، أعاد التوراة بعد ضياعها."
  },
  {
    "name": "حزقيا",
    "meaning": "قوة الرب",
    "details": "من الصالحين، دعا قومه إلى عبادة الله وإصلاح ما فسد من أمورهم."
  },
  {
    "name": "إرميا",
    "meaning": "الرب يؤسس",
    "details": "نبي من أنبياء بني إسرائيل، بكى على خراب القدس ودعا قومه للرجوع إلى الله."
  },
  {
    "name": "إلياسع",
    "meaning": "الله مخلصي",
    "details": "يقال إنه اليسع نفسه أو نبي قريب منه، دعا قومه إلى عبادة الله وحده."
  },
  {
    "name": "دانيال",
    "meaning": "قاضي الله",
    "details": "نبي من أنبياء بني إسرائيل، عُرف بالحكمة والبصيرة وتفسير الرؤى."
  },
  {
    "name": "عزير",
    "meaning": "القوي العزيز",
    "details": "نبي من أنبياء بني إسرائيل أعاد التوراة بعد ضياعها."
  }
]
