import 'package:depiproject/core/constants/assets.dart';

final List<Map<String, String>> onBoardingData = [
  {
    "image": Imagespath.onboarding_1,
    "title": "📖 اقرأ وارتقِ",
    "text":
        "استمتع بقراءة القرآن الكريم بسهولة مع واجهة مريحة ومنظمة للسور والآيات.",
  },
  {
    "image": Imagespath.onboarding_2,
    "title": "🌙 ذكر ودعاء",
    "text": "تابع أذكارك اليومية والأدعية المأثورة بسهولة عبر تطبيق تقوي.",
  },
  {
    "image": Imagespath.onboarding_3,
    "title": "🕌 لا يفوتك وقت الصلاة",
    "text": "مواقيت الصلاة الدقيقة مع تنبيهات مريحة لتعينك على المواظبة.",
  },
];
